

//①做题技巧

//滑动窗口法分为定长和不定长(双指针法)
// 欧拉计划第八题



//记忆法/记忆数组 -> 用来保存中间数组的
// 欧拉计划第十四题



//大整数 / 高精度
// 欧拉计划第十三题 、
//只能用字符串去存储 

//大整数加法 ：倒着存储 、 处理好答案长度，第一个位置放数长 
// oj78题

//大整数乘法：倒序存储，答案最短长度
//oj471题

//大整数减法：
//

//大整数除法： 
//大整数比较：先比较长度、再遍历、大整数减法



//方向数组
// 欧拉计划第十一题






//②二分专题
// 二分的本质： 删除不存在答案的区间


//sort： 排序  
// 头文件：algorithm  算法
//sort(起始位,结束位的后一位, 排序方法)
//二分
//oj357题、oj381题、oj380题


//特殊（二分的特殊情况）: oj387题
// 1.
/*
while (L != R) {
	mid = (L + R) / 2;
	L = mid + 1;
	R = mid;
}
*/
// 2.
/*
while (L != R) {
	mid = (L + R + 1) / 2;
	L = mid;
	R = mid - 1;
}
*/


//二分答案 ： oj390原木切割 / oj389 / oj393
//对答案二分：切割长度
//







//③STL容器

//string  vector  stack  queue  deque  priority_queue  set  map
//






//④oj题目

//模拟、贪心、枚举、前缀和
//






//⑤leecode题目讲解







//⑥搜索

//递归、排列组合、走地图、搜索、套路




// 区分度、暴力解法
//



